/*
 * @Author: chriswoodcn
 * @Email: chriswoodcn@aliyun.com
 * @Date: 2023-07-04 17:22:11
 * @LastEditors: chriswoodcn
 * @LastEditTime: 2023-07-04 17:32:46
 * @Description: 树的定义和基本术语 p39
 * 
 * Copyright (c) 2023 by chriswoodcn, All Rights Reserved. 
 */
// ---------------------------------------------树的定义和基本术语---------------------------------------------------
// 树的定义 树是n个结点的有限集。
// 空树：n=0
// 根结点、分支结点、叶子结点
// 非空树的特性
// 子树

// 基本术语
// 结点之间的关系描述
//    祖先、子孙、双亲、兄弟…结点
//    路径、路径长度
// 结点、树的属性描述
//    结点的层次（深度）——从上往下
//    结点的高度——从下往上
//    结点的度——有几个孩子
//    树的度——各结点的度的最大值
// 有序树、无序树
// 森林

// 树的性质
// 树中的结点数等于所有结点的度数之和加1。
// 度为m的树第i层上至多有m^i-1个结点
// 度为m的数、m叉数的区别