/*
 * @Author: chriswoodcn
 * @Email: chriswoodcn@aliyun.com
 * @Date: 2023-07-12 16:47:31
 * @LastEditors: chriswoodcn
 * @LastEditTime: 2023-07-12 17:24:35
 * @Description: 图 p55~58
 *
 * Copyright (c) 2023 by chriswoodcn, All Rights Reserved.
 */
// ----------------------------------图的基本概念---------------------------------------
// 图G由顶点集V和边集E组成 G=(V,E)
// V(G)表示图G中顶点的有限非空集;E(G)表示图G中顶点之间的关系集合
// 若V={V1,V2...Vn} 则用|V|表示图G中顶点的个数 也称图G的阶
// E={(u,v)|u∈V,v∈V} 用|E|表示图G中边的条数
// 线性表可以是空表 树可以是空树 图不可以是空 V肯定是非空集

// 无向图 有向图
// 若E是无向边的有限集合;图G为无向图 (v,w) = (w,v)
// 例如 G1=(V1,E1)
// V1 = {A,B,C,D,E}
// E1 = {(A,B),(B,D),(B,E),(C,D),(C,E),(D,E)}
// 若E是有向边的有限集合;图G为有向图 <v,w> ≠ <w,v>
// 例如 G2=(V2,E2)
// V1 = {A,B,C,D,E}
// E1 = {<A,B>,<A,C>,<A,D>,<A,E>,<B,A>,<B,C>,<B,E>,<C,D>}

// 简单图 多重图
// 简单图 1.不存在重复边 2.不存在顶点到自身的边
// 多重图 某两个节点之间的边数多于一条 允许顶点通过同一条边和自己关联

// 顶点的度/入度/出度
// 无向图: 顶点v的度是指该顶点的边的条数TD(v)  ∑TD(v) = 2|E|
// 有向图:
//    入度:顶点v为终点的有向边的条数ID(v)
//    出度:顶点v为起点的有向边的条数OD(v)
//    顶点的度: 入度+出度     ∑ID(v)=∑OD(v)=|E|

// 顶点-顶点关系描述
// 1.路径 顶点Vp到顶点Vq之间的一条路径是指顶点序列,Vp,Vi1...Vin,Vq
// 2.回路 第一个顶点和最后一个顶点相同的路径称为回路或环
// 3.简单路径 路径序列中顶点不重复出现的称为简单路径
// 4.简单回路 除了第一个和最后一个,顶点不重复出现的回路称为简单回路
// 5.路径长度 路径上边的数量
// 6.点到点的距离 从顶点p到顶点q的最短路径若存在,,此路径长度称为pq的距离,若不存在路径,则记为无穷∞
// 7.连通
//    无向图: 顶点p到顶点q有路径存在,pq连通
//    有向图: 顶点p到q q到p都有路径 pq强连通
//  ----------------------------------邻接矩阵法---------------------------------------

// ----------------------------------邻接表法---------------------------------------

// ----------------------------------十字链表---------------------------------------

// ----------------------------------邻接多重表---------------------------------------