/*
 * @Author: chriswoodcn
 * @Email: chriswoodcn@aliyun.com
 * @Date: 2023-06-29 15:38:58
 * @LastEditors: chriswoodcn
 * @LastEditTime: 2023-06-29 15:49:51
 * @Description: 双端队列 P26
 * 
 * Copyright (c) 2023 by chriswoodcn, All Rights Reserved. 
 */
// -------------------------------------------双端队列------------------------------------------------------
// 双端队列是只允许在两端插入,两端删除的线性表
// 输入受限的双端队列 只允许一端插入,两端删除的线性表
// 输出受限的双端队列 只允许两端插入,一端删除的线性表
// 数据元素输入序列为1,2,3,4 则哪些输出序列是合法的,哪些是非法的?
// *****考点: 对输出序列合法性的判断*****
