/*
 * @Author: chriswoodcn
 * @Email: chriswoodcn@aliyun.com
 * @Date: 2023-07-11 14:16:37
 * @LastEditors: chriswoodcn
 * @LastEditTime: 2023-07-11 15:33:23
 * @Description: 哈夫曼树 p52
 * 
 * Copyright (c) 2023 by chriswoodcn, All Rights Reserved. 
 */
//-------------------------------------------哈夫曼树--------------------------------------------------------
// 带权路径长度 = 节点的权*根到该节点的路径长度(经过的边数)
// 树的带权路径长度 = 所有叶节点的带权路径长度之和

// 哈夫曼树定义
// 含有n个叶节点的二叉树中,带权路径长度最小的二叉树为哈夫曼树,也叫最优二叉树

// 哈夫曼树的构造
// 1.将n个节点分别作为n棵一个节点的二叉树,构成森林F
// 2.构造一个新节点,从F中选取两棵权值最小的树为新节点的左右子树,且新节点的权值为这两个子树权值的和
// 3.F中删除刚才两个子树,将新节点加入F中
// 4.重复2和3 直到F中只剩一棵树
// => 每个初始的节点最终都会成为叶子节点,且权值越小的节点到根结点路径长度越大
// => 哈夫曼树总结点为2n-1  n个叶子节点结合了n-1次所以总共有2n-1节点
// => 哈夫曼树不存在度为1的节点
// => 哈夫曼树不唯一

// 哈夫曼编码
// A 00
// B 01
// C 10
// D 11
// 100道题目 80c 10a 8b 2d
// 所有答案二进制长度 100*2 = 200bit
// 使用哈夫曼树 80 10 8 2
// C 0
// A 10
// B 111
// C 110
// 所有答案二进制长度 80*1+10*2+8*3+2*3 = 130bit